MENU_STRUCTURE = {
    "EN1990": {
        "code": "EN 1990",
        "title": "Основы проектирования строительных конструкций",
        "sections": {
            "sec1": {
                "title": "1. Общие положения",
                "subsections": {
                    "EN1990_1_1": "1.1 Область применения",
                    "EN1990_1_2": "1.2 Нормативные ссылки",
                    "EN1990_1_3": "1.3 Условия применения",
                    "EN1990_1_4": "1.4 Различие между Принципами и Правилами применения",
                    "EN1990_1_5": "1.5 Термины и определения",
                    "EN1990_1_6": "1.6 Символы"
                }
            },
            "sec2": {
                "title": "2. Основные требования",
                "subsections": {
                    "EN1990_2_1": "2.1 Основные требования к сооружениям",
                    "EN1990_2_2": "2.2 Надежность",
                    "EN1990_2_3": "2.3 Расчетный срок эксплуатации",
                    "EN1990_2_4": "2.4 Долговечность",
                    "EN1990_2_5": "2.5 Обеспечение качества"
                }
            },
            "sec3": {
                "title": "3. Принципы предельных состояний",
                "subsections": {
                    "EN1990_3_1": "3.1 Общие положения",
                    "EN1990_3_2": "3.2 Расчетные ситуации",
                    "EN1990_3_3": "3.3 Критические предельные состояния",
                    "EN1990_3_4": "3.4 Предельные состояния по эксплуатационной пригодности",
                    "EN1990_3_5": "3.5 Расчет по предельным состояниям"
                }
            },
            "sec4": {
                "title": "4. Базисные переменные",
                "subsections": {
                    "EN1990_4_1": "4.1 Воздействия и влияние окружающей среды",
                    "EN1990_4_2": "4.2 Свойства материалов и изделий",
                    "EN1990_4_3": "4.3 Геометрические размеры"
                }
            },
            "sec5": {
                "title": "5. Расчет строительных конструкций и проектирование на основании результатов испытаний",
                "subsections": {
                    "EN1990_5_1": "5.1 Расчет строительных конструкций",
                    "EN1990_5_2": "5.2 Проектирование на основании результатов испытаний"
                }
            },
            "sec6": {
                "title": "6. Проверки с использованием метода частных коэффициентов",
                "subsections": {
                    "EN1990_6_1": "6.1 Общие положения",
                    "EN1990_6_2": "6.2 Ограничения",
                    "EN1990_6_3": "6.3 Расчетные значения",
                    "EN1990_6_4": "6.4 Критические предельные состояния",
                    "EN1990_6_5": "6.5 Предельные состояния по эксплуатационной пригодности"
                }
            }
        }
    }
}
